catalog={
	"Нидерланды":"Амстердам",
    "Андорра":"Андорра-ла-Велья",
    "Греция":"Афины",
    "Сербия":"Белград",
    "Германия":"Берлин",
    "Швейцария":"Берн",
    "Словакия":"Братислава",
    "Бельгия":"Брюссель",
    "Венгрия":"Будапешт",
    "Румыния":"Бухарест",
    "Лихтенштейн":"Вадуц",
    "Мальта":"Валлетта",
    "Польша":"Варшава",
    "Ватикан":"Ватикан",
    "Австрия":"Вена",
    "Литва":"Вильнюс",
    "Ирландия":"Дублин",
    "Хорватия":"Загреб",
    "Украина":"Киев",
    "Молдавия":"Кишинёв",
    "Дания":"Копенгаген",
    "Португалия":"Лиссабон",
    "Великобритания":"Лондон",
    "Словения":"Любляна",
    "Люксембург":"Люксембург",
    "Испания":"Мадрид",
    "Беларусь":"Минск",
    "Монако":"Монако",
    "Россия":"Москва",
    "Норвегия":"Осло",
    "Франция":"Париж",
    "Черногория":"Подгорица",
    "Чехия":"Прага",
    "Исландия":"Рейкьявик",
    "Латвия":"Рига",
    "Италия":"Рим",
    "Сан-Марино":"Сан-Марино",
    "Босния и Герцеговина":"Сараево",
    "Северная Македония":"Скопье",
    "Болгария":"София",
    "Швеция":"Стокгольм",
    "Эстония":"Таллин",
    "Албания":"Тирана",
    "Финляндия":"Хельсинки"
}
print("-"*100)



while True:
    print('Список возможных действий:')
    print('0 - Добавить навую страну')
    print('1 - Поиск страны по названию')
    print('2 - Удаление страны из каталога')
    print('3 - Показать информацию о всех странах в каталоге')
    print('4 - Закончить работу')
    print("-" * 100)



    # запрашиваем у пользователя номер действия:
    user_choice=int(input("Выберите № действия: "))



    if user_choice == 0:
        new_country = input("Введите новую страну: ")
        new_capital = input("Введите столицу новой страны: ")
        if new_country not in catalog:
            catalog[new_country] = new_capital
        else:
            print("Страна уже есть")
            print("-" * 100)



    if user_choice == 1:
        seek_country = input("Введите страну которую хотите найти: ")
        if seek_country in catalog:
            print(f"Страна: {seek_country} " + "  Столица: " + catalog[seek_country])
        else:
            print("Такой страны нет")



    if user_choice == 2:
        deleting_country = input("Введите страну которую хотите удалить: ")
        if deleting_country in catalog:
            del catalog[deleting_country]
            print(f"Ты удалил страну ({deleting_country})")
        else:
            print("Такой страны нет")



    if user_choice == 3:
        for i in catalog.items():
            print(i, end="  ")
    print('\n'+"-" * 100)



    if user_choice == 4:
        break